ТОИР_демо/src/DataProcessors/торо_ПанельАдминистрированияТОиР/торо_ПанельАдминистрированияТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПанельАдминистрированияТОиР</name>
</mdclass:DataProcessor>

ТОИР_демо/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИерархическиеСтруктурыОР</name>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_СтатусыОбъектовРемонтаВУчете/торо_СтатусыОбъектовРемонтаВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыОбъектовРемонтаВУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОР</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_ПринятиеОРКУчету/торо_ПринятиеОРКУчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПринятиеОРКУчету</name>
  <registerRecords>InformationRegister.торо_СтатусыОбъектовРемонтаВУчете</registerRecords>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/DataProcessors/торо_ПанельАдминистрированияТОиР/Forms/ФормаПереходаКИспользованиюДокументовЖЦ/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОткрытаИзНастроек") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Форму можно открыть если ранее Вы не использовали документы принятия и списания объектов ремонта.'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
	Если Не Отказ Тогда
		ЗаполнитьДеревоОбъектовРемонта(Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяОрганизация",
		Истина);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		
		Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновноеПодразделение",
		Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоОбъектовРемонта(Отказ)
	
	ОсновнаяИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	
	Если Не ЗначениеЗаполнено(ОсновнаяИерархия) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнена константа ""Иерархия для ввода новых ОР"".'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Если ОсновнаяИерархия.ИзменяетсяДокументами Тогда
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОбъектРемонта,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	НЕ торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ЭтоГруппа КАК ДоступноРедактирование
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии";
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СтруктураИерархии", ОсновнаяИерархия);
	
	ТаблицаИерархии = Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = ТаблицаИерархии.НайтиСтроки(Новый Структура("РодительИерархии", Справочники.торо_ОбъектыРемонта.ПустаяСсылка()));
	
	Для каждого Строка Из МассивСтрок Цикл
		
		НС = ТаблицаСОбъектамиРемонта.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НС,Строка);
		ДобавитьСтрокиВДеревоПоТаблице(НС, ТаблицаИерархии);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДобавитьСтрокиВДеревоПоТаблице(СтрокаДерева, Таблица)
	
	МассивСтрок = Таблица.НайтиСтроки(Новый Структура("РодительИерархии", СтрокаДерева.ОбъектРемонта));
	
	Если Не СтрокаДерева.ДоступноРедактирование Тогда
		СтрокаДерева.ИндексКартинки = 5;
	ИначеЕсли МассивСтрок.Количество() > 0 Тогда 
		СтрокаДерева.ИндексКартинки = 2;
	КонецЕсли; 
	
	Для каждого Строка Из МассивСтрок Цикл
		
		НС = СтрокаДерева.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НС,Строка);
		ДобавитьСтрокиВДеревоПоТаблице(НС, Таблица);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокументыПринятияКУчетуНаСервере(МассивОбъектов, Организация, Подразделение, ВсеДокументыСозданы)
	
	Ответственный = Пользователи.АвторизованныйПользователь();
	Комментарий   = "Документ создан системой при установке флага ""Использовать документы принятия и списания оборудования""";
	
	СписокВсехОбъектовРемонта = Новый СписокЗначений;
	
	Для каждого ЭлементМассива Из МассивОбъектов Цикл
		СписокВсехОбъектовРемонта.Добавить(ЭлементМассива.ОбъектРемонта);		
	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ
	               |	торо_СтатусыОбъектовРемонтаВУчете.Регистратор,
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
	               |ИЗ
	               |	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	               |ГДЕ
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта В
	               |			(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", СписокВсехОбъектовРемонта);
	
	ИмеющиесяДокументы = Запрос.Выполнить().Выгрузить();
	
	Для каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ОбъектРемонта          = ЭлементМассива.ОбъектРемонта;
		ДатаВводаВЭксплуатацию = ЭлементМассива.ДатаВводаВЭксплуатацию;
		
		МассивИмеющихся = ИмеющиесяДокументы.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонта));
		
		Если МассивИмеющихся.Количество() > 0 Тогда
			ДокментОбъект  = МассивИмеющихся[0].Регистратор.ПолучитьОбъект();
		Иначе
			ДокументОбъект = Документы.торо_ПринятиеОРКУчету.СоздатьДокумент();
		КонецЕсли; 
		
		ДокументОбъект.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
		ДокументОбъект.ОбъектРемонта          = ОбъектРемонта;
		ДокументОбъект.Организация            = Организация;
		ДокументОбъект.Подразделение          = Подразделение;
		ДокументОбъект.Дата                   = ТекущаяДата();
		ДокументОбъект.Ответственный          = Ответственный;
		ДокументОбъект.Комментарий            = Комментарий;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Объект ремонта <%1> принят к учету.'"),ОбъектРемонта);
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось провести документ <Принятие объекта ремонта к учету> для объекта ремонта <%1>'"),ОбъектРемонта);
			Сообщение.Сообщить();
			ВсеДокументыСозданы = Ложь;
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПринятияКУчету(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнено поле <Организация>.'");
		Сообщение.Поле  = "Организация";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнено поле <Подразделение>.'");
		Сообщение.Поле  = "Подразделение";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		МассивСтруктур       = Новый Массив;
		ЗначениеПринятКУчету = ПредопределенноеЗначение("Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету");
		ЭлементыДерева       = ТаблицаСОбъектамиРемонта.ПолучитьЭлементы();
		
		Для каждого СтрокаДерева Из ЭлементыДерева Цикл
			Если СтрокаДерева.СтатусВУчете = ЗначениеПринятКУчету Тогда
				Структура = Новый Структура("ОбъектРемонта, ДатаВВодаВЭксплуатацию", СтрокаДерева.ОбъектРемонта, СтрокаДерева.ДатаВВодаВЭксплуатацию);
				МассивСтруктур.Добавить(Структура);
			КонецЕсли;
			
			ДополнитьМассивОбъектовДляПринятияКУчету(СтрокаДерева, МассивСтруктур, ЗначениеПринятКУчету);
			
		КонецЦикла; 
		
		ВсеДокументыСозданы = Истина;
		
		СоздатьДокументыПринятияКУчетуНаСервере(МассивСтруктур, Организация, Подразделение, ВсеДокументыСозданы);
		
		Если ВсеДокументыСозданы Тогда
			Закрыть();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Для части объектов ремонта не удалось создать документы принятия объектов ремонта к учету.
								|Исправьте замечания и повторите попытку.'");
			Сообщение.Сообщить(); 
		КонецЕсли; 
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьМассивОбъектовДляПринятияКУчету(СтрокаДереваОбъектов, МассивСтруктур, ЗначениеПринятКУчету)
	
	ЭлементыДерева = СтрокаДереваОбъектов.ПолучитьЭлементы();
	
	Для каждого СтрокаДерева Из ЭлементыДерева Цикл
		
		Если СтрокаДерева.СтатусВУчете = ЗначениеПринятКУчету Тогда
			Структура = Новый Структура("ОбъектРемонта, ДатаВВодаВЭксплуатацию", СтрокаДерева.ОбъектРемонта, СтрокаДерева.ДатаВВодаВЭксплуатацию);
			МассивСтруктур.Добавить(Структура);
		КонецЕсли; 
		
		ДополнитьМассивОбъектовДляПринятияКУчету(СтрокаДерева, МассивСтруктур, ЗначениеПринятКУчету);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
